app/controllers/dashboard_controller.rb

SELECT * FROM "domains" WHERE ("domains".user_id = 1)
SELECT count(*) AS count_all FROM "domains" WHERE ("domains".user_id = 1)
---
  def index
    @subdomains_count = 0
    @logged_user.domains.each do |dom|
      @subdomains_count += dom.subdomains.count