app/controllers/domains_controller.rb

SELECT * FROM "domains" WHERE ("domains"."id" = 1)
---
  def show
    @domain = Domain.find(params[:id])