app/controllers/domains_controller.rb

SELECT * FROM "domains"
---
  def index
    @domains = Domain.all

INSERT INTO "domains" ("created_at", "updated_at", "domain", "user_id", "path") VALUES('2010-02-02 16:56:15', '2010-02-02 16:56:15', 'kikoo.com', NULL, 'kikoo')
INSERT INTO "subdomains" ("created_at", "updated_at", "url", "domain_id", "path", "mainsub") VALUES('2010-02-13 15:45:20', '2010-02-13 15:45:20', 'www', 12, 'joelcogen.com/www', 't')
---
  def create
    @domain = Domain.new(params[:domain])
    @domain.user = @logged_user

    respond_to do |format|
      if @domain.save
        # Create main WWW subdomain
        @subdomain = Subdomain.new()
        @subdomain.url = "www"
        @subdomain.domain = @domain
        @subdomain.path = "www"
        @subdomain.mainsub = true

        if @subdomain.save

SELECT * FROM "domains" WHERE ("domains"."id" = 1)
---
  def edit
    @domain = Domain.find(params[:id])

SELECT "domains".id FROM "domains" WHERE ("domains"."domain" = 'joelcogen.com' AND "domains".id <> 1) LIMIT 1
UPDATE "domains" SET "updated_at" = '2010-02-02 17:30:29', "path" = 'joelcogen' WHERE "id" = 1
---
  def update
    @domain = Domain.find(params[:id])

    respond_to do |format|
      if @domain.update_attributes(params[:domain])

SELECT * FROM "domains" WHERE ("domains"."id" = 2)
SELECT * FROM "subdomains" WHERE ("subdomains".domain_id = 8)
DELETE FROM "domains" WHERE "id" = 2
DELETE FROM "subdomains" WHERE "id" = 6
---
  def destroy
    @domain = Domain.find(params[:id])
    @domain.subdomains.each do |sub|
      sub.destroy
    end

    @domain.destroy

SELECT "domains".id FROM "domains" WHERE ("domains"."domain" = 'joelcogen.com' AND "domains".id <> 1) LIMIT 1
SELECT * FROM "services" WHERE ("services"."id" = 1)
---
  def addservice
    @domain = Domain.find(params[:domain_id])
    @service = Service.find(params[:service_id])