app/controllers/login_controller.rb

  def login
    loggedin = false

    # Check credentials
    @user = User.find_by_username(params[:user][:username])
---
SELECT "users".id FROM "users" WHERE ("users"."username" = 'root' AND "users".id <> 1) LIMIT 1

  def logout
    if session[:session]
      @user = User.find_by_session(session[:session])
      if @user
        @user.session = nil
        @user.save
---
UPDATE "users" SET "updated_at" = '2009-11-11 14:31:32', "session_ts" = '2009-11-11 14:31:32' WHERE "id" = 1

  def savenewpassword
    @user = User.find(params[:user][:id])

    respond_to do |format|
      if @user and @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2009-11-11 14:30:29', "password" = '2b64f2e3f9fee1942af9ff60d40aa5a719db33b8ba8dd4864bb4f11e25ca2bee00907de32a59429602336cac832c8f2eeff5177cc14c864dd116c8bf6ca5d9a9' WHERE "id" = 1