app/controllers/service_email_mailboxes_controller.rb

SELECT * FROM "service_email_mailboxes"
---
  def index
    @mailboxes = ServiceEmailMailbox.all

SELECT * FROM "service_email_mailboxes" WHERE ("service_email_mailboxes"."id" = 1)
---
  def edit
    @mailbox = ServiceEmailMailbox.find(params[:id])

INSERT INTO "service_email_mailboxes" ("address", "size", "created_at", "updated_at", "domain_id", "forward", "forward_only", "full_name", "password") VALUES('joel', 300, '2010-02-15 16:04:55', '2010-02-15 16:04:55', 14, '', 'f', 'Joel Cogen', 'kikoolol')
---
  def create
    @mailbox = ServiceEmailMailbox.new(params[:service_email_mailbox])
    legal_domain = @logged_user.domains.include? @mailbox.domain

    if legal_domain and @mailbox.save

SELECT * FROM "service_email_mailboxes" WHERE ("service_email_mailboxes"."id" = 1)
UPDATE "service_email_mailboxes" SET "updated_at" = '2010-02-15 16:10:38', "forward" = 'joelcogen@hotmail.com
UPDATE "users" SET "updated_at" = '2010-02-15 16:10:38', "session_ts" = '2010-02-15 16:10:38' WHERE "id" = 1
---
  def update
    @mailbox = ServiceEmailMailbox.find(params[:id])
    @newatts = params[:service_email_mailbox]
    if @newatts[:password] == ''
      @newatts[:password_confirmation] = nil
      @newatts[:password] = @mailbox.password
    end

    if not @logged_user.domains.include? @mailbox.domain
      flash[:error] = 'Invalid mailbox'
      redirect_to :action => 'index'
    elsif @mailbox.update_attributes(params[:service_email_mailbox])

SELECT * FROM "service_email_mailboxes" WHERE ("service_email_mailboxes"."id" = 1)
DELETE FROM "service_email_mailboxes" WHERE "id" = 1
---
  def destroy
    @mailbox = ServiceEmailMailbox.find(params[:id])

    if @logged_user.domains.include? @mailbox.domain
      @mailbox.destroy