app/controllers/service_email_mailboxes_controller.rb

SELECT * FROM "service_email_mailboxes" WHERE ("service_email_mailboxes"."id" = 1)
---
  def show
    @service_email_mailbox = ServiceEmailMailbox.find(params[:id])