app/controllers/service_email_controller.rb

  def removefromuser
    ServiceEmailUser.find(:first, :conditions => { :user_id => params[:user_id] }).destroy
---
DELETE FROM "service_email_users" WHERE "id" = 3
SELECT * FROM "service_email_users" WHERE ("service_email_users"."user_id" = '10') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)