app/controllers/service_email_controller.rb

SELECT * FROM "domains" WHERE ("domains".user_id = 1)
SELECT * FROM "service_email_mailboxes" WHERE ("service_email_mailboxes"."domain_id" IN (14,15))
---
  def index
    @mailboxes = ServiceEmailMailbox.find(:all, :conditions=>{:domain_id=>@logged_user.domains})