app/controllers/services_controller.rb

SELECT * FROM "services"
---
  def index
    @services = Service.all

SELECT * FROM "services" WHERE ("services"."id" = 1)
---
  def show
    @service = Service.find(params[:id])

SELECT * FROM "services" WHERE ("services"."id" = 1)
---
  def edit
    @service = Service.find(params[:id])

INSERT INTO "services" ("name", "created_at", "updated_at", "description") VALUES('WWW', '2009-11-02 15:15:31', '2009-11-02 15:15:31', 'apache2')
---
  def create
    @service = Service.new(params[:service])

    respond_to do |format|
      if @service.save

SELECT * FROM "services" WHERE ("services"."id" = 1)
UPDATE "services" SET "updated_at" = '2010-02-15 12:34:29', "controller" = 'service_email', "description" = 'E-mail server' WHERE "id" = 2
---
  def update
    @service = Service.find(params[:id])

    respond_to do |format|
      if @service.update_attributes(params[:service])

SELECT * FROM "services" WHERE ("services"."id" = 1)
DELETE FROM "services" WHERE "id" = 1
---
  def destroy
    @service = Service.find(params[:id])
    @service.destroy