app/controllers/subdomains_controller.rb

  def new
    @subdomain = Subdomain.new
    @subdomain.domain = Domain.find(params[:domain])
---
SELECT * FROM "domains" WHERE ("domains".user_id = 1)

  def edit
    @subdomain = Subdomain.find(params[:id])
---
SELECT * FROM "domains" WHERE ("domains"."id" = 13)
SELECT * FROM "subdomains" WHERE ("subdomains"."id" = 7)

  def create
    @subdomain = Subdomain.new(params[:subdomain])

    respond_to do |format|
      if @subdomain.save
---
INSERT INTO "subdomains" ("created_at", "updated_at", "url", "domain_id", "path", "mainsub") VALUES('2010-02-13 16:54:30', '2010-02-13 16:54:30', 'lol', 0, 'lol', 'f')

  def update
    @subdomain = Subdomain.find(params[:id])

    respond_to do |format|
      if @subdomain.update_attributes(params[:subdomain])
---
SELECT * FROM "subdomains" WHERE ("subdomains"."mainsub" = 't') LIMIT 1
UPDATE "subdomains" SET "updated_at" = '2010-02-14 14:00:24', "mainsub" = 't' WHERE "id" = 11

  def destroy
    if Subdomain.find(:all).count > 1
      @subdomain = Subdomain.find(params[:id])
      @subdomain.destroy

      # If deleted mainsub, we need to set another one
      if @subdomain.mainsub
        newmain = Subdomain.find(:first)
        newmain.mainsub = true
        newmain.save
---
SELECT * FROM "subdomains" WHERE ("subdomains"."id" = 2)
SELECT * FROM "subdomains" WHERE ("subdomains"."mainsub" = 't') LIMIT 1
DELETE FROM "subdomains" WHERE "id" = 2
UPDATE "subdomains" SET "updated_at" = '2010-02-14 14:00:28', "mainsub" = 't' WHERE "id" = 9