app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "services" INNER JOIN "services_users" ON "services".id = "services_users".service_id WHERE ("services_users".user_id = 1 )
---
  def show
    @user = User.find(params[:id])
    @available_services = (@logged_user.root? ? Service.all : @logged_user.services) - @user.services

INSERT INTO "users" ("created_at", "updated_at", "username", "full_name", "parent_id", "password", "email") VALUES('2009-11-02 13:02:27', '2009-11-02 13:02:27', 'joel', 'Joel Cogen', NULL, 'kikoo', 'joel@joelcogen.com')
---
  def create
    @user = User.new(params[:user])
    @user.parent = @logged_user
    @user.used_space = 0

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-02-15 12:41:41', "session_ts" = '2010-02-15 12:41:41' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "services" WHERE ("services"."id" = 70006381629600)
UPDATE "users" SET "updated_at" = '2009-11-19 10:26:00', "session_ts" = '2009-11-19 10:26:00' WHERE "id" = 1
---
  def addservice
    @user = User.find(params[:user_id])
    @user.services << Service.find(params[:service_id])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "services" WHERE ("services"."id" = 1)
UPDATE "users" SET "updated_at" = '2009-11-19 10:26:03', "session_ts" = '2009-11-19 10:26:03' WHERE "id" = 1
---
  def removeservice
    @user = User.find(params[:user_id])
    @user.services.delete(Service.find(params[:service_id]))

    respond_to do |format|
      if @user.save