webapp/app/controllers/domains_controller.rb

SELECT * FROM "domains" WHERE ("domains"."id" = 1)
---
  def show
    @domain = Domain.find(params[:id])

INSERT INTO "domains" ("created_at", "updated_at", "domain", "user_id") VALUES('2010-03-28 13:47:51', '2010-03-28 13:47:51', 'newdom.com', 2)
INSERT INTO "subdomains" ("created_at", "updated_at", "url", "domain_id", "path", "mainsub") VALUES('2010-03-28 13:47:51', '2010-03-28 13:47:51', 'www', 2, 'www', 't')
---
  def create
    @domain = Domain.new(params[:domain])
    @domain.user = @logged_user

    respond_to do |format|
      if @domain.save
        # Create main WWW subdomain
        @subdomain = Subdomain.new()
        @subdomain.url = "www"
        @subdomain.domain = @domain
        @subdomain.path = "www"
        @subdomain.mainsub = true

        if @subdomain.save

SELECT * FROM "domains" WHERE ("domains"."id" = 1)
SELECT * FROM "subdomains" WHERE ("subdomains".domain_id = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "domains" WHERE "id" = 1
DELETE FROM "subdomains" WHERE "id" = 298486374
---
  def destroy
    @domain = Domain.find(params[:id])
    if @domain.user == @logged_user
      @domain.subdomains.each do |sub|
        sub.destroy
      end
      @domain.destroy

SELECT "domains".id FROM "domains" WHERE ("domains"."domain" = 'test.com' AND "domains".id <> 1) LIMIT 1
SELECT * FROM "services" WHERE ("services"."id" = 2053932785)
SELECT "users".id FROM "users" INNER JOIN "services_users" ON "users".id = "services_users".user_id WHERE ("users"."id" = 1) AND ("services_users".service_id = 2053932785 ) LIMIT 1
UPDATE "logged_users" SET "updated_at" = '2010-03-28 13:47:51', "session_ts" = '2010-03-28 13:47:51' WHERE "id" = 2053932786
---
  def addservice
    @domain = Domain.find(params[:domain_id])
    @service = Service.find(params[:service_id][0])

    if @domain.user == @logged_user and @service.users.include? @logged_user and @service.by_domain
      @domain.services << @service

      if @domain.save