webapp/app/controllers/login_controller.rb

  def login
    # Check credentials
    @user = User.find_by_username(params[:user][:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'joel') LIMIT 1

  def setup
    redirect_to :action => 'index' if User.all.count > 0
---
SELECT * FROM "users"

  def dosetup
    redirect_to :action => 'index' if User.all.count > 0

    @user = User.new(params[:user])
    @user.id = 1
    @user.parent_id = nil

    if @user.save
---
SELECT * FROM "users"
INSERT INTO "users" ("max_bandwidth", "created_at", "max_space", "updated_at", "username", "used_space", "max_subusers", "id", "full_name", "parent_id", "password", "email", "max_subdomains", "ohmd_password") VALUES(NULL, '2010-03-28 15:28:34', -1, '2010-03-28 15:28:34', 'joel', 0, -1, 1, 'Joel Cogen', NULL, 'ac0e5d745e0aa2935b9207ad5d87351f2fa4f103b789551a2da1a9bd15d3557068e5b5c5d08c2ccf4e48cb307bab966ca6b072a9314fe5a1b63240fc575f6149', 'joecog@cogen.com', -1, '\$6\$48YDQcNA\$VLgdfAYFgJNwPjyD57ycwDtujw7CmTLkqSjFVk6krRLm0GkkTriPUXYLceueiR9aW/OB/mZ5sTj5gPs8YUmOJ1')