webapp/app/controllers/service_email_users_controller.rb

SELECT * FROM "service_email_users" WHERE ("service_email_users"."user_id" = 1) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
    if params[:user_id]
      @service_email_user = ServiceEmailUser.find(:first, :conditions => { :user_id => params[:user_id] })

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def new
    @service_email_user = ServiceEmailUser.new(:user_id => params[:user_id])
    @user = User.find(params[:user_id])

INSERT INTO "service_email_users" ("created_at", "updated_at", "max_aliases", "user_id", "max_mailboxes") VALUES('2010-03-28 15:45:34', '2010-03-28 15:45:34', 2, 6, 3)
---
  def create
    @service_email_user = ServiceEmailUser.new(params[:service_email_user])

    if @service_email_user.save