webapp/app/controllers/services_controller.rb

  def destroy
    @service = Service.find(params[:id])
    @service.destroy
---
SELECT * FROM "services" WHERE ("services"."id" = 2053932785)
DELETE FROM "services" WHERE "id" = 2053932785