webapp/app/controllers/services_controller.rb

  def index
    @services = Service.all
---
SELECT * FROM "services"

  def show
    @service = Service.find(params[:id])
---
SELECT * FROM "services" WHERE ("services"."id" = 6)

  def edit
    @service = Service.find(params[:id])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)

      @service.install_files = extractpath
      @service.save
      @logged_user.services << @service
      @logged_user.save
---
UPDATE "logged_users" SET "updated_at" = '2010-03-28 13:36:43', "session_ts" = '2010-03-28 13:36:43' WHERE "id" = 90

  def update
    @service = Service.find(params[:id])

    if @service.update_attributes(params[:service])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)
UPDATE "services" SET "updated_at" = '2010-03-28 15:29:53', "tech_name" = 'E-Mail', "description" = '' WHERE "id" = 1