webapp/app/controllers/service_email_mailboxes_controller.rb

SELECT * FROM "service_email_mailboxes" WHERE ("service_email_mailboxes"."id" = 198609129)
SELECT "domains".id FROM "domains" WHERE ("domains"."id" = 1) AND ("domains".user_id = 1) LIMIT 1
---
  def edit
    @mailbox = ServiceEmailMailbox.find(params[:id])

    unless @logged_user.domains.include? @mailbox.domain

SELECT "domains".id FROM "domains" WHERE ("domains"."id" = 1) AND ("domains".user_id = 1) LIMIT 1
INSERT INTO "service_email_mailboxes" ("address", "size", "created_at", "updated_at", "domain_id", "forward", "forward_only", "full_name", "password") VALUES('newtest', -1, '2010-03-28 13:47:52', '2010-03-28 13:47:52', 1, NULL, NULL, NULL, '$6$O4BgVYgO$rGmyVht87rS/D1i3M0IX1w5XtIDSV3W6qGaaXJcmavPZoyKoNaRGfdX4cLM2sEW0PCxLv/O/c/xM1moFNwHHJ/')
---
  def create
    @mailbox = ServiceEmailMailbox.new(params[:service_email_mailbox])
    legal_domain = @logged_user.domains.include? @mailbox.domain

    if legal_domain and @mailbox.save

SELECT * FROM "service_email_mailboxes" WHERE ("service_email_mailboxes"."id" = 198609129)
SELECT "domains".id FROM "domains" WHERE ("domains"."id" = 1) AND ("domains".user_id = 2) LIMIT 1
UPDATE "logged_users" SET "updated_at" = '2010-03-28 13:47:52', "session_ts" = '2010-03-28 13:47:52' WHERE "id" = 2053932786
---
  def update
    @mailbox = ServiceEmailMailbox.find(params[:id])
    @newatts = params[:service_email_mailbox]
    if @newatts[:password] == ''
      @newatts[:password_confirmation] = nil
      @newatts[:password] = @mailbox.password
    end

    if not @logged_user.domains.include? @mailbox.domain
      flash[:error] = 'Invalid mailbox'
      redirect_to :action => 'index'
    elsif @mailbox.update_attributes(params[:service_email_mailbox])

SELECT * FROM "service_email_mailboxes" WHERE ("service_email_mailboxes"."id" = 198609129)
SELECT "domains".id FROM "domains" WHERE ("domains"."id" = 1) AND ("domains".user_id = 1) LIMIT 1
DELETE FROM "service_email_mailboxes" WHERE "id" = 198609129
---
  def destroy
    @mailbox = ServiceEmailMailbox.find(params[:id])

    if @logged_user.domains.include? @mailbox.domain
      @mailbox.destroy