webapp/app/controllers/services_controller.rb

  def destroy
    # Mark service as deleted
    @service = Service.find(params[:id])
    @service.update_attribute(:deleted, true)
---
UPDATE "services" SET "updated_at" = '2010-03-29 19:51:44', "deleted" = 't' WHERE "id" = 2053932785