webapp/app/controllers/service_email_mailboxes_controller.rb

SELECT * FROM "service_email_mailboxes"
---
  def index
    @mailboxes = ServiceEmailMailbox.all