webapp/app/controllers/subdomains_controller.rb

  def new
    @subdomain = Subdomain.new
    @subdomain.domain = Domain.find(params[:domain])
---
SELECT * FROM "domains" WHERE ("domains"."id" = 1)

  def edit
    @subdomain = Subdomain.find(params[:id])
---
SELECT * FROM "domains" WHERE ("domains"."id" = 1)
SELECT * FROM "subdomains" WHERE ("subdomains"."id" = 2053932785)

  def create
    @subdomain = Subdomain.new(params[:subdomain])

    if @subdomain.domain.user != @logged_user
      flash[:error] = 'Invalid domain'
      redirect_to :controller => 'domains'
    elsif @subdomain.save
---
INSERT INTO "subdomains" ("created_at", "updated_at", "url", "domain_id", "path", "mainsub") VALUES('2010-03-28 13:47:52', '2010-03-28 13:47:52', 'newsub', 1, NULL, 'f')

  def update
    @subdomain = Subdomain.find(params[:id])

    if @subdomain.domain.user != @logged_user or params[:subdomain][:domain_id] or params[:subdomain][:domain]
      flash[:error] = 'Invalid domain'
      redirect_to :controller => "domains"
    elsif @subdomain.update_attributes(params[:subdomain])
---
SELECT * FROM "domains" WHERE ("domains"."id" = 1)
SELECT * FROM "subdomains" WHERE ("subdomains"."mainsub" = 't' AND "subdomains"."domain_id" = 1) LIMIT 1
UPDATE "logged_users" SET "updated_at" = '2010-03-28 13:47:52', "session_ts" = '2010-03-28 13:47:52' WHERE "id" = 2053932786
UPDATE "subdomains" SET "updated_at" = '2010-03-28 13:47:52', "url" = 'newurl' WHERE "id" = 2053932785

  def destroy
    @subdomain = Subdomain.find(params[:id])
    if @subdomain.domain.subdomains.count > 1
      if @subdomain.domain.user == @logged_user
        # If deleted mainsub, we need to set another one
        if @subdomain.mainsub
          newmain = @subdomain.domain.subdomains.select {|s| s != @subdomain}.first
          newmain.update_attribute(:mainsub, true)
        end
        @subdomain.destroy
---
SELECT * FROM "domains" WHERE ("domains"."id" = 1)
SELECT * FROM "subdomains" WHERE ("subdomains"."id" = 2053932785)
SELECT count(*) AS count_all FROM "subdomains" WHERE ("subdomains".domain_id = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "subdomains" SET "updated_at" = '2010-03-28 13:47:52', "mainsub" = 't' WHERE "id" = 298486374
DELETE FROM "subdomains" WHERE "id" = 2053932785