webapp/app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users".parent_id = 15)
SELECT * FROM "services" INNER JOIN "services_users" ON "services".id = "services_users".service_id WHERE ("services_users".user_id = 15 )
---
  def show
    @user = User.find(params[:id])

    if @user.parent != @logged_user
      flash[:error] = "Invalid user"
      redirect_to :controller => 'users', :action => 'index'
    end

    @available_services = (@logged_user.root? ? Service.all : @logged_user.services) - @user.services

SELECT * FROM "users" WHERE ("users".parent_id = 15)
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("max_bandwidth", "created_at", "max_space", "updated_at", "username", "used_space", "max_subusers", "full_name", "parent_id", "password", "email", "max_subdomains", "ohmd_password") VALUES(NULL, '2010-03-28 15:20:12', -1, '2010-03-28 15:20:12', 'bedo', 0, -1, 'Bedo Homo', 1, 'a3f3de095ca3dbb532fbe7c5e9421c0f8aa197895113e8daf41341d61bbac3ede451f5192ce0a173014b5c69f235f2f99a165cfc551c7aa596ee3999c100c399', 'bedo@homo.goatse', -1, '\$6\$7I.xRF27\$O7G6.JjUalYKZJnUABVVNQP0za6ZxRbNtHf/8.GIr.gTZCEIQjxpEws8J9o6VOV9D7FA7WGwJtz2Y5h44cNMf1')
---
  def create
    @user = User.new(params[:user])
    @user.parent = @logged_user
    @user.used_space = 0

    if @user.save

SELECT * FROM "users" WHERE ("users".parent_id = 7)
UPDATE "logged_users" SET "updated_at" = '2010-03-28 15:50:31', "session_ts" = '2010-03-28 15:50:31' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    if @user.parent != @logged_user
      flash[:error] = "Invalid user"
      redirect_to :controller => 'users', :action => 'index'
    elsif @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 15
INSERT INTO "users" ("max_bandwidth", "created_at", "max_space", "updated_at", "username", "used_space", "max_subusers", "full_name", "parent_id", "password", "email", "max_subdomains", "ohmd_password") VALUES(NULL, '2010-03-28 15:19:46', NULL, '2010-03-28 15:19:46', 'kikoo', NULL, NULL, NULL, -1, NULL, NULL, NULL, NULL)
---
  def destroy
    @user = User.find(params[:id])

    if @user.parent == @logged_user
      @user.destroy
      # We create a dummy user with parent -1, so Ohmd knows who to remove
      @deluser = User.new(:id => @user.id,
                          :username => @user.username,
                          :parent_id => -1)
      @deluser.save false

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "services" WHERE ("services"."id" = 6)
SELECT * FROM "services" INNER JOIN "services_users" ON "services".id = "services_users".service_id WHERE ("services_users".user_id = 17 )
UPDATE "logged_users" SET "updated_at" = '2010-03-28 15:20:14', "session_ts" = '2010-03-28 15:20:14' WHERE "id" = 93
---
  def addservice
    @user = User.find(params[:user_id])
    @service = Service.find(params[:service_id][0])

    if @logged_user.root? or (@user.parent == @logged_user and @logged_user.services.include? @service)
      @user.services << @service

      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "services" WHERE ("services"."id" = 6)
SELECT "services".id FROM "services" INNER JOIN "services_users" ON "services".id = "services_users".service_id WHERE ("services"."id" = 6) AND ("services_users".user_id = 1 ) LIMIT 1
UPDATE "logged_users" SET "updated_at" = '2010-03-28 15:19:32', "session_ts" = '2010-03-28 15:19:32' WHERE "id" = 93
---
  def removeservice
    @user = User.find(params[:user_id])
    @service = Service.find(params[:service_id])

    if @logged_user.root? or (@user.parent == @logged_user and @logged_user.services.include? @service)
      @user.services.delete(@service)

      if @user.save