webapp/app/controllers/users_controller.rb

  def destroy
    @user = User.find(params[:id])

    if @user.parent == @logged_user
      # Don't destroy now, we have to delete it from Ohmd
      #@user.destroy
      @user.password = nil
      @user.parent = nil
      @user.ohmd_status = User::OHMD_TO_DEL
      @user.save false
---
UPDATE "logged_users" SET "updated_at" = '2010-03-28 15:19:46', "session_ts" = '2010-03-28 15:19:46' WHERE "id" = 93