webapp/app/controllers/users_controller.rb

INSERT INTO "users" ("max_bandwidth", "created_at", "max_space", "updated_at", "username", "used_space", "max_subusers", "full_name", "parent_id", "password", "email", "max_subdomains", "ohmd_password") VALUES(NULL, '2010-03-28 13:47:52', 100, '2010-03-28 13:47:52', 'secondnewuser', 0, 1, NULL, 1, 'newpassword', 'test@test.com', 1, NULL)
---
  def create
    @user = User.new(params[:user])
    @user.parent = @logged_user
    @user.used_space = 0

    if @user.save

UPDATE "users" SET "updated_at" = '2010-03-28 13:47:53', "full_name" = 'New name' WHERE "id" = 2
---
  def update
    @user = User.find(params[:id])

    if @user.parent != @logged_user
      flash[:error] = "Invalid user"
      redirect_to :controller => 'users', :action => 'index'
    elsif @user.update_attributes(params[:user])

UPDATE "logged_users" SET "updated_at" = '2010-03-28 13:47:53', "session_ts" = '2010-03-28 13:47:53' WHERE "id" = 2053932786
UPDATE "users" SET "updated_at" = '2010-03-28 13:47:53', "full_name" = 'New Name' WHERE "id" = 2
---
  def profileupdate
    @user = @logged_user
    @newatts = params[:user]
    if @newatts[:password] == ''
      @newatts[:password_confirmation] = nil
      @newatts[:password] = @user.password
    end

    if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users".parent_id = 2)
---
  def destroy
    @user = User.find(params[:id])

SELECT * FROM "services" INNER JOIN "services_users" ON "services".id = "services_users".service_id WHERE ("services_users".user_id = 2 )
---
  def removeservice
    @user = User.find(params[:user_id])
    @service = Service.find(params[:service_id])

    if @logged_user.root? or (@user.parent == @logged_user and @logged_user.services.include? @service)

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def login_as_me
    @user = User.find(params[:id])